app/Http/Controllers/UserController.php

    public function index()
    {
        // TASK: turn this SQL query into Eloquent
        // select * from users
        //   where email_verified_at is not null
        //   order by created_at desc
        //   limit 3


        $users = User::whereNotNull('email_verified_at')->latest()->limit(3)->get();
---
select * from `users` where `email_verified_at` is not null order by `created_at` desc limit 3

    public function show($userId)
    {
        $user = User::findOrFail($userId); // TASK: find user by $userId or show "404 not found" page
---
select * from `users` where `users`.`id` = '1`' limit 1